PhilColbert/AirWhere-esp32/main/vario/airwhere_esp32_vario.cpp

//
//Iain Frew - 8/30/17
//
//IDE is Visual Studio using Vmicro add-in for Arduino development
//
//This is a port of Hari Nair project to esp32 and using the DMP functionaility of
//the 9250 IMU.
//
//The majortity of this code was some great work by Jeff Rowberg for the
//mpu6050 library and the i2cdevlib interface, and Hari Nair for the Vario design.
//The calibration came from  Luis Ródenas.

//I integrated Jeff's MPU6050 library to take advantage of the 6050 dmp processing which works fine
//on esp8266 but a bit tempremental on esp32 as there are some issues with timing using Jeff's library
//and the I2C bus. You need to be able to read in chunks using a buffer size of about 16.
//So for my chips and setup I played around with the buffer_length set in i2cdevlib.cpp and eventually chose 16.
//Anything larger tends to screw up the data being read. Also found that the readings are noisy when
//reading from the DMP at 200Hz as jeff found. So reduced ODR to 100Hz and modified the code accordingly to take
//that into account.

//I have a define to enable/disable DMP processing rather than calculate manually the rotations that Hari used.
//Seems to be accurate and reduces the loop elapsed time by a factor of 3.

//Correct calibration I have found is key but on two gy-86, values of 1700 and 1200 for kfzVariance an kfazVariance
//seem to work best. Configuration in the config.h file of zero theshold 20 and climb threshold 20
//also produce good results.
//
//To build, you only need the esp32 core library installed as this sketch uses the preference, wire and wifi libraries
//
//
//This code uses the gy-86 IMU and the reference system is different than the CJMCU-117 that Hari used. If you use the
//cjmcu-117 module then just turn the board upside down and you get the same reults as the gy-86 which assumes the chips are up facing you
//when used.

// gy-86 interface
// 3.3V  3.3v
// GND  GND
// SCL  GPIO21
// SDA  GPIO22
// INT  GPIO12
// audio GPIO13
// calibration button GPIO15


//uncomment to use the dmp processor rather than the manual calculations of quaternions
//#define dmp

//Output Teapot is the Processing example from Jeff's mpu6050 library for arduino and works when DMP
//is enabled.
//#define OUTPUT_TEAPOT


//#define IMU_DEBUG
//#include "airwhere_esp32_vario.h"

#include <Preferences.h>
#include <esp32-hal-ledc.h>
#include <Wire.h>
//#include <BLEDevice.h>
//#include <BLEServer.h>
//#include <BLEUtils.h>
//#include <BLE2902.h>
#include <HardwareSerial.h>


#include "VarioAudio.h"
#include "util.h"
#include "pztbl.h"
#include "MS5611.h"
#include "KalmanVario.h"
#include "config.h"
#include "cct.h"
#include "MPU6050_6Axis_MotionApps20.h"
#include "MPU9250.h"
#include "MahonyAHRS.h"


extern int current_pressure;
extern int current_altitude;
extern int current_vario;
extern int current_temperature;
extern int current_battery;
extern int climb_threshold;
extern int zero_threshold;
extern int sink_threshold;
extern char calibrate_vario;
extern bool run_vario;

extern bool airwhere_tones_on;
// this is done by commands, the other on buzzer is for when you switch on .
extern int turn_on_off_buzzer;

extern "C" {

}

extern int debug_level;

//setup serial port for write to bluetooth module
//HardwareSerial BT(2);


//char LK8EX1_Sentence[80];
//char GPS_Sentence[80];

#define PRESSURE_AT_18000_FT 50000
// this needs to be the lowest pressure we find - on high pressure days its less than 1013 millibars
// 110000 is 700m below sea level on a standard pressure day so should be ok.
#define PRESSURE_AT_0_FT 110000

uint32_t timePreviousUs;

uint32_t timeNowUs;
float imuTimeDeltaSecs;
float baroTimeDeltaSecs;
volatile int last_sample_pressure;

float accel[3];
float gyro[3];
float kfAltitudeCm = 0.0f;
float kfClimbrateCps = 0.0f;
float avgeCps = 0.0f;
float zAccelAccumulator = 0.0f;
float kfzVariance = 1700;//This gets calulated during in baro.test calibration but my mpu6050 it as always around 1700 so setting as default;
float kazVariance = 1200;//This gets measured during calibration of accelrometer but my mpu6050 its is always around 1200;

//keep track of average integrated vario cps over period of time up to 15s max.
// 20ms( 10ms temp + 10ms pressure) sample rate so 50 sample pairs  per second;
int variosamplecnt = 0;
float oldvarioavge = 0.0;
int net_vario = 10; //default to 1s integrated vario; net vari is in 0.1s increments



int32_t audioCps;

// switched to use main loops channel int audiochannel = 1;
int audiochannel = 0;


int pinSDA = 25;
// CHANGE BACK
int pinSCL = 13;
//int pinSCL = 35;
int pinDRDYInt = 12;
// change to the one in the main loop int pinAudio = 13;
int pinAudio = 32;

//int pinCalibBtn = 15;



static volatile int drdyCounter;
static volatile int drdyFlag;
int baroCounter = 0;;
int lk8exCounter = 0;
int timeoutSeconds = 0;
int turnonBuzzer;


const int buffersize = 1000;     //Amount of readings used to average, make it higher to get more precision but sketch will be slower  (default:1000)
int acel_deadzone = 8;			 //Acelerometer error allowed, make it lower to get more precision, but sketch may not converge  (default:8)
int giro_deadzone = 1;           //Giro error allowed, make it lower to get more precision, but sketch may not converge  (default:1)
int16_t ax, ay, az, gx, gy, gz;
int mean_ax, mean_ay, mean_az, mean_gx, mean_gy, mean_gz = 0;
int ax_offset, ay_offset, az_offset, gx_offset, gy_offset, gz_offset;

Preferences preferences;
MPU6050 mpu;  //used for mpu6050 dmp functionality
MPU9250 imu; //6050 compatible. used for non dmp functionality. original code
MS5611 baro;
KalmanVario kf;
VarioAudio audio;

// MPU control/status vars
bool dmpReady = false;  // set true if DMP init was successful
uint8_t mpuIntStatus;   // holds actual interrupt status byte from MPU
uint8_t devStatus;      // return status after each device operation (0 = success, !0 = error)
uint16_t packetSize;    // expected DMP packet size (default is 42 bytes)
uint16_t fifoCount = 0;     // count of all bytes currently in FIFO
uint8_t fifoBuffer[64]; // FIFO storage buffer

						// orientation/motion vars
Quaternion q;           // [w, x, y, z]         quaternion container
VectorInt16 aa;         // [x, y, z]            accel sensor measurements
VectorInt16 aaReal;     // [x, y, z]            gravity-free accel sensor measurements
VectorInt16 aaWorld;    // [x, y, z]            world-frame accel sensor measurements
VectorFloat gravity;    // [x, y, z]            gravity vector

