PhilColbert/AirWhere-esp32/main/vario/airwhere_esp32_vario.cpp
						// packet structure for InvenSense teapot demo
uint8_t teapotPacket[14] = { '$', 0x02, 0,0, 0,0, 0,0, 0,0, 0x00, 0x00, '\r', '\n' };



int batteryVoltage(void) {
	int adcSample = 0;
	for (int inx = 0; inx < 4; inx++) {
		adcSample += analogRead(A0);
		delay(1);
	}
	adcSample /= 4;
	// voltage divider with 120K and 33K to scale 4.2V down to < 1.0V for the ESP8266 ADC
	// actual measurement 0.854V with battery voltage = 4.0V => actual scale up from resistive divider = 4.0/0.854 = 4.6838
	// adc isn't very accurate either, experimental correction factor ~ 1.04, so effective scale up is 1.04 * 4.6838
	return (int)((adcSample*1.04f*4.6838f*10.0f) / 1023.0f + 0.5f); //  voltage x 10
}

void audio_indicateBatteryVoltage(int bv) {
	int numBeeps;
	if (bv >= 40) numBeeps = 5;
	else
		if (bv >= 39) numBeeps = 4;
		else
			if (bv >= 37) numBeeps = 3;
			else
				if (bv >= 36) numBeeps = 2;
				else  numBeeps = 1;
				while (numBeeps--) {
					audio.GenerateTone(BATTERY_TONE_FREQHZ, 300);
					delay(300);
				}
}

void IRAM_ATTR DRDYInterruptHandler() {
	drdyFlag = 1; // indicate new MPU6050 data is available
	drdyCounter++;
}

void initTime() {
	timeNowUs = timePreviousUs = micros();
}

void updateTime() {
	timeNowUs = micros();
	imuTimeDeltaSecs = timeNowUs > timePreviousUs ? (float)(timeNowUs - timePreviousUs) : 2000.0f; // if rollover use expected time difference
	imuTimeDeltaSecs = imuTimeDeltaSecs / 1000000.0f;
	timePreviousUs = timeNowUs;
}

void powerDown() {
	// residual current draw after power down is the sum of ESP8266 deep sleep mode current,
	// MPU9250 sleep mode current, MS5611 standby current, quiescent current of voltage
	// regulators, and miscellaneous current through resistive paths e.g. the
	// ADC voltage divider.
	audio.SetFrequency(0); // switch off pwm audio
	mpu.setSleepEnabled(true); // put MPU9250 in sleep mode
	ESP.deepSleep(0); // ESP8266 in sleep can only recover with a reset/power cycle
}


// if imu calibration data in flash is corrupted, the accel and gyro biases are
// set to 0, and this uncalibrated state is indicated with a sequence of alternating
// low and high beeps.
void indicateUncalibratedAccelerometer() {
	for (int cnt = 0; cnt < 5; cnt++) {
		audio.GenerateTone(200, 500);
		audio.GenerateTone(2000, 500);
	}
}




// "no-activity" power down is indicated with a series of descending
// tones. If you hear this, switch off the vario as there is still
// residual current draw from the circuit components
void indicatePowerDown() {
	audio.GenerateTone(2000, 1000);
	audio.GenerateTone(1000, 1000);
	audio.GenerateTone(500, 1000);
	audio.GenerateTone(250, 1000);
}

// problem with MS5611 calibration CRC, assume communication
// error or bad device. Indicate with series of 10 high pitched beeps.
void indicateFaultMS5611() {
	for (int cnt = 0; cnt < 10; cnt++) {
		audio.GenerateTone(MS5611_ERROR_TONE_FREQHZ, 1000);
		delay(100);
	}
}

// problem reading MPU9250 ID, assume communication
// error or bad device. Indicate with series of 10 low pitched beeps.
void indicateFaultMPU9250() {
	for (int cnt = 0; cnt < 10; cnt++) {
		audio.GenerateTone(MPU9250_ERROR_TONE_FREQHZ, 1000);
		delay(100);
	}
}


void meansensors() {
	long i, buff_ax, buff_ay, buff_az, buff_gx, buff_gy, buff_gz;
	int16_t az_values[buffersize];

	kazVariance = 0.0;
	buff_ax = 0; buff_ay = 0; buff_az = 0; buff_gx = 0; buff_gy = 0; buff_gz = 0;
	i = 0;

	while (i < (buffersize)) {
		// read raw accel/gyro measurements from device
		mpu.getMotion6(&ax, &ay, &az, &gx, &gy, &gz);
		//Serial.printf("az raw value %d\r\n", az);
		buff_ax += ax;
		buff_ay += ay;
		buff_az += az;
		az_values[i] = az;
		buff_gx += gx;
		buff_gy += gy;
		buff_gz += gz;

		i++;
		delay(2); //Needed so we don't get repeated measures
	}
	mean_ax = buff_ax / buffersize;
	mean_ay = buff_ay / buffersize;
	mean_az = buff_az / buffersize;
	mean_gx = buff_gx / buffersize;
	mean_gy = buff_gy / buffersize;
	mean_gz = buff_gz / buffersize;

	for (int n = 0; n < buffersize; n++) {
		kazVariance += (az_values[n] - mean_az)*(az_values[n] - mean_az);
		//Serial.printf("%d %d\r\n",(int)pa[n],(int)z[n]);
	}
	kazVariance = kazVariance / (buffersize - 1);
	Serial.print("kazVariance = "); Serial.println(kazVariance);
	/*Serial.println(mean_ax);
	Serial.println(mean_ay);
	Serial.println(mean_az);
	Serial.println(mean_gx);
	Serial.println(mean_gx);
	Serial.println(mean_gx);*/
}

bool calibration() {

	int numtries = 0;
	mpu.setXAccelOffset(0);
	mpu.setYAccelOffset(0);
	mpu.setZAccelOffset(0);
	mpu.setXGyroOffset(0);
	mpu.setYGyroOffset(0);
	mpu.setZGyroOffset(0);

	//First 100 measures are discarded
	for (int j = 0; j < 100; j++) {
		mpu.getMotion6(&ax, &ay, &az, &gx, &gy, &gz);
		delay(2);
	}

	//The mpu6050 yaw figues drift and takes a little time to stablize ~15 secs with reading settling after ~30s

	meansensors();
	delay(1000);

	ax_offset = -mean_ax / 8;
	ay_offset = -mean_ay / 8;
	az_offset = (16384 - mean_az) / 8;

	gx_offset = -mean_gx / 4;
	gy_offset = -mean_gy / 4;
	gz_offset = -mean_gz / 4;

	while (1) {
		int ready = 0;
		mpu.setXAccelOffset(ax_offset);
		mpu.setYAccelOffset(ay_offset);
		mpu.setZAccelOffset(az_offset);

		mpu.setXGyroOffset(gx_offset);
		mpu.setYGyroOffset(gy_offset);
		mpu.setZGyroOffset(gz_offset);

		meansensors();
		Serial.printf("...\r\n");

		if (abs(mean_ax) <= acel_deadzone) ready++;
		else ax_offset = ax_offset - mean_ax / acel_deadzone;

		if (abs(mean_ay) <= acel_deadzone) ready++;
		else ay_offset = ay_offset - mean_ay / acel_deadzone;

		if (abs(16384 - mean_az) <= acel_deadzone) ready++;
		else az_offset = az_offset + (16384 - mean_az) / acel_deadzone;

		if (abs(mean_gx) <= giro_deadzone) ready++;
		else gx_offset = gx_offset - mean_gx / (giro_deadzone + 1);

		if (abs(mean_gy) <= giro_deadzone) ready++;
		else gy_offset = gy_offset - mean_gy / (giro_deadzone + 1);

		if (abs(mean_gz) <= giro_deadzone) ready++;
		else gz_offset = gz_offset - mean_gz / (giro_deadzone + 1);

