PhilColbert/AirWhere-esp32/main/vario/airwhere_esp32_vario.cpp
		numtries++;

		if (ready == 6) {
			return true;
		}

		if (numtries > 10) return false;
	}

}

float runningAverageofCps(float cps)
{
	//Integrated vario calculation. Average the climbrate over last NET_VARIO secs
	//We sample at 20ms(10ms temp, 10ms pressure), so 200 samples is 4secs.

	double avgecps;

	if (net_vario > NET_VARIO_MAX) {
		net_vario = NET_VARIO_MAX;
	}
	variosamplecnt = (variosamplecnt + 1);
	if (variosamplecnt > (net_vario * 50)/10) variosamplecnt = (net_vario * 50/10);

	avgecps = oldvarioavge*(float(variosamplecnt - 1) / variosamplecnt) + cps / variosamplecnt;
	//Serial.printf("cps %d average cps %d old average %d vario samplecnt %d\r\n", int(cps),int(avgecps),int(oldvarioavge), variosamplecnt);
	oldvarioavge = avgecps;


	return float(avgecps);

}





void vario_setup() {


	delay(100); // delay(1) is required, additional delay so battery voltage can settle

	Serial.printf("\r\nESPxxxx MPU6050 MS5611 VARIO compiled on %s at %s\r\n", __DATE__, __TIME__);
	Wire.begin(pinSDA, pinSCL);
	//Wire.setClock(400000); // set clock frequency AFTER Wire.begin()


     Wire.setClock(200000); // set clock frequency AFTER Wire.begin()
	//5.4
	Wire.setTimeOut(250);



	audio.Config(pinAudio, audiochannel,sink_threshold,climb_threshold, zero_threshold);

	int bv = batteryVoltage();
	Serial.printf("battery voltage = %d.%dV\r\n", bv / 10, bv % 10);
	audio_indicateBatteryVoltage(bv);
	delay(1000);

	if (!baro.ReadPROM()) {
		Serial.printf("Bad CRC read from MS5611 calibration PROM\r\n");
		Serial.flush();
		//indicateFaultMS5611(); // 10 high pitched beeps
		//powerDown();   // try power-cycling to fix this
	}

	if (!mpu.testConnection()) {
		Serial.printf("Error reading mpu6050 WHO_AM_I register\r\n");
		Serial.flush();
	//	indicateFaultMPU9250(); // 10 low pitched beeps
	//	powerDown();   // try power-cycling to fix this
	}

	//read stored calibration parameters

	if (preferences.begin("fastvario", false))
	{
		ax_offset = preferences.getInt("axBias", 0);
		ay_offset = preferences.getInt("ayBias", 0);
		az_offset = preferences.getInt("azBias", 0);
		gx_offset = preferences.getInt("gxBias", 0);
		gy_offset = preferences.getInt("gyBias", 0);
		gz_offset = preferences.getInt("gzBias", 0);
		kfzVariance = preferences.getInt("kfzVar", KF_ZPRESS_VARIANCE);
		kazVariance = preferences.getInt("kfazVar", KF_ZACCEL_VARIANCE);
	}
	else
	{
		ax_offset=0;
		ay_offset=0;
		az_offset=0;
		gx_offset=0;
		gy_offset=0;
		gz_offset = 0;
		kfzVariance=KF_ZPRESS_VARIANCE;
		kazVariance=KF_ZACCEL_VARIANCE;
	}


#ifndef dmp
	imu.axBias_ = ax_offset;
	imu.ayBias_ = ay_offset;
	imu.azBias_ = az_offset;
	imu.gxBias_ = gx_offset;
	imu.gyBias_ = gy_offset;
	imu.gzBias_ = gz_offset;
#endif

	if ((ax_offset == 0) && (ay_offset == 0) && (az_offset == 0)) {
		indicateUncalibratedAccelerometer(); // series of alternating low/high tones
	}

	Serial.printf("Using saved calibration parameters :\r\n");
	Serial.printf("Accel : axBias %d, ayBias %d, azBias %d\r\n", ax_offset, ay_offset, az_offset);
	Serial.printf("Gyro : gxBias %d, gyBias %d, gzBias %d\r\n", gx_offset, gy_offset, gz_offset);
	Serial.printf("KfzVariance : %f, KfazVariance : %f \r\n", kfzVariance, kazVariance);


	drdyCounter = 0;
	drdyFlag = 0;
	// INT output of MPU6050 is configured as push-pull, active high pulse.

	pinMode(pinDRDYInt, INPUT);
	attachInterrupt(digitalPinToInterrupt(pinDRDYInt), DRDYInterruptHandler, RISING);

	// configure MPU6050 to start generating gyro and accel data at 200Hz ODR

#ifdef dmp
	// load and configure the DMP
	Serial.println(F("Initializing DMP..."));
	devStatus = mpu.dmpInitialize();
#else
	imu.ConfigAccelGyro();
	devStatus = 0;
#endif



	// Try to calibrate gyro each time on power up. if the unit is not at rest, give up
	// and use the last saved gyro biases.
	// Allow a 30 seconds for unit to be left undisturbed so gyro can be calibrated.
	// This delay is indicated with a series of 10 short beeps. During this time if you press and hold the
	// calibration button (GPIO0), the unit will calibrate both accelerometer and gyro.
	// As soon as you hear the long confirmation tone, release the calibration
	// button and put the unit in accelerometer calibration position resting undisturbed on a horizontal surface
	// You will have some time
	// to do this, indicated by a series of beeps. After calibration, the unit will generate another
	// tone, save the calibration parameters to flash, and continue with normal vario operation





	/*pinMode(pinCalibBtn, INPUT_PULLUP); digitalWrite(pinCalibBtn, HIGH);
	int bCalibrateAccelerometer = 1;
	// short beeps for ~5 seconds
	for (int inx = 0; inx < 10; inx++) {
		delay(500);
		audio.GenerateTone(CALIB_TONE_FREQHZ, 50);
		if (digitalRead(pinCalibBtn) == 0) {
			delay(100); // debounce the button
			if (digitalRead(pinCalibBtn) == 0) {
				bCalibrateAccelerometer = 1;
				break;
			}
		}
	}
*/

#ifdef dmp
	// make sure it dmp initialisation worked (returns 0 if so)
	if (devStatus == 0) {


		// turn on the DMP, now that it's ready
		Serial.println(F("Enabling DMP..."));
		mpu.setDMPEnabled(true);
		mpuIntStatus = mpu.getIntStatus();

		// set our DMP Ready flag so the main loop() function knows it's okay to use it
		Serial.println(F("DMP ready! Waiting for first interrupt..."));
		dmpReady = true;

		// get expected DMP packet size for later comparison
		packetSize = mpu.dmpGetFIFOPacketSize();


	}
	else {
		// ERROR!
		// 1 = initial memory load failed
		// 2 = DMP configuration updates failed
		// (if it's going to break, usually the code will be 1)
		Serial.print(F("DMP Initialization failed (code "));
		Serial.print(devStatus);
		Serial.println(F(")"));
	}
#endif
	//read the config value for vario calibration now instead of a button
	//Serial.println("calibrate value "); Serial.println(calibrate_vario);
	if (calibrate_vario == 'y') {
		// acknowledge calibration long tone
		audio.GenerateTone(CALIB_TONE_FREQHZ, 3000);
		// allow 5 seconds for the unit to be placed in calibration position with the
		// accelerometer +z pointing downwards. Indicate this delay with a series of short beeps
		Serial.printf("Place Vario on flat surface and do not move until calibration complete..you have 5 seconds before calibration\r\n");

		for (int inx = 0; inx < 20; inx++) {
			delay(200);
			Serial.printf("...\r\n");
			audio.GenerateTone(CALIB_TONE_FREQHZ, 50);
		}

		Serial.printf("Calibrating accel & gyro\r\n");
		calibration();
		Serial.printf("End Calibration accel & gyro\r\n");

		Serial.printf("Saving Calibration data to non volatile store\r\n");
		preferences.putInt("axBias", ax_offset);
		preferences.putInt("ayBias", ay_offset);
		preferences.putInt("azBias", az_offset);
		preferences.putInt("gxBias", gx_offset);
		preferences.putInt("gyBias", gy_offset);
		preferences.putInt("gzBias", gz_offset);
		Serial.printf("Calibrated data saved\r\n");


