PhilColbert/AirWhere-esp32/main/vario/airwhere_esp32_vario.cpp
	}
	// normal operation flow, attempt to calibrate gyro. If calibration isn't possible because the unit is disturbed,
	// use the last saved gyro biases




#ifdef dmp
	mpu.setXGyroOffset(gx_offset);
	mpu.setYGyroOffset(gy_offset);
	mpu.setZGyroOffset(gz_offset);
	mpu.setXAccelOffset(ax_offset);
	mpu.setYAccelOffset(ay_offset);
	mpu.setZAccelOffset(az_offset);
#endif





	//calibrate pressure sensor always

	delay(1000);
	baro.Reset();
	baro.GetCalibrationCoefficients();
	baro.Test(200, &kfzVariance);
	baro.AveragedSample(4);
	baro.InitializeSampleStateMachine();

	// indicate calibration complete
	audio.GenerateTone(CALIB_TONE_FREQHZ, 1000);

	//save the calculated variances
	preferences.putInt("kfzVar", int(kfzVariance));
	preferences.putInt("kfazVar", int(kazVariance));
	Serial.printf("kfzVariance initialized to %d\r\n", int(kfzVariance));
	Serial.printf("kfazVariance initialized to %d\r\n", int(kazVariance));

	// initialize kalman filter with barometer estimated altitude, measured kfzvariance
	//and kfazvariance, the accelerometer noise variance. The value for kfazvariance should be
	//the actual environmental noise, ie from thermals, sinky air etc. But I've found
	//that the value chosen based on the noise measured during calibration seems to work well.
	//

	kf.Config(kfzVariance, kazVariance, KF_ACCELBIAS_VARIANCE, baro.zCmAvg_, 0.0f, 0.0f);

	initTime();
	zAccelAccumulator = 0.0f;
	baroTimeDeltaSecs = 0.0f;
	baroCounter = 0;
	timeoutSeconds = 0;
	Serial.printf("Finshed vario setup\r\n");


}


void vario_loop() {


	//Serial.println("vario loop");
	while (run_vario)
	{
		//v5
		audio.UpdateConfig(sink_threshold,climb_threshold, zero_threshold);

#ifdef dmp
		// wait for MPU interrupt or extra packet(s) available

	// goes into here and locks - ?

		while (!drdyFlag && fifoCount < packetSize) {
			// other program behavior stuff here
			// .
			// .
			// .
			// if you are really paranoid you can frequently test in between other
			// stuff to see if mpuInterrupt is true, and if so, "break;" from the
			// while() loop to immediately process the MPU data
			// .
			// .
			// .


		}

		// get INT_STATUS byte
		mpuIntStatus = mpu.getIntStatus();

		// get current FIFO count
		fifoCount = mpu.getFIFOCount();

		// check for overflow (this should never happen unless our code is too inefficient)
		if ((mpuIntStatus & 0x10) || fifoCount == 1024) {
			// reset so we can continue cleanly
	//		Serial.println("vario loop 1b");
			mpu.resetFIFO();
			Serial.println(F("FIFO overflow! resetting.."));
			DEBUG_PRINTLN(F("Enabling FIFO..."));
			mpu.setFIFOEnabled(true);
			DEBUG_PRINTLN(F("Enabling DMP..."));
			mpu.setDMPEnabled(true);
		}
		else if (mpuIntStatus & 0x02) {
			// wait for correct available data length, should be a VERY short wait
			while (fifoCount < packetSize) fifoCount = mpu.getFIFOCount();
			//		Serial.println("vario loop 1c");
					// read a packet from FIFO
			mpu.getFIFOBytes(fifoBuffer, packetSize);

			// track FIFO count here in case there is > 1 packet available
			// (this lets us immediately read more without waiting for an interrupt)
			fifoCount -= packetSize;

			// display initial world-frame acceleration, adjusted to remove gravity
			// and rotated based on known orientation from quaternion
			mpu.dmpGetQuaternion(&q, fifoBuffer);
			mpu.dmpGetAccel(&aa, fifoBuffer);
			mpu.dmpGetGravity(&gravity, &q);
			mpu.dmpGetLinearAccel(&aaReal, &aa, &gravity);
			mpu.dmpGetLinearAccelInWorld(&aaWorld, &aaReal, &q);
			/*Serial.print("aworld\t");
			Serial.print(aaWorld.x);
			Serial.print("\t");
			Serial.print(aaWorld.y);
			Serial.print("\t");
			Serial.println(aaWorld.z);*/


		}
#ifdef OUTPUT_TEAPOT
		// display quaternion values in InvenSense Teapot demo format:
		teapotPacket[2] = fifoBuffer[0];
		teapotPacket[3] = fifoBuffer[1];
		teapotPacket[4] = fifoBuffer[4];
		teapotPacket[5] = fifoBuffer[5];
		teapotPacket[6] = fifoBuffer[8];
		teapotPacket[7] = fifoBuffer[9];
		teapotPacket[8] = fifoBuffer[12];
		teapotPacket[9] = fifoBuffer[13];
		Serial.write(teapotPacket, 14);
		teapotPacket[11]++; // packetCount, loops at 0xFF on purpose
#endif
#endif


		if (drdyFlag) { // new MPU6050 data ready, 100Hz ODR => ~10mS sample interval

			drdyFlag = 0;
			updateTime();
			cct_SetMarker();
			//Serial.print("mpu time delta secs"); Serial.println(imuTimeDeltaSecs, 3); //this should be 10ms
			if (imuTimeDeltaSecs < 0.009 || imuTimeDeltaSecs > 0.011)
			{
				//taking too long due to config settings being chnaged for example so lets ignore and reset
				baro.InitializeSampleStateMachine();
				baroCounter = 0;
				zAccelAccumulator = 0.0f;
				baroTimeDeltaSecs = 0.0f;
				//do not process any data
			}
			else
			{
#ifdef dmp
				//compensated acceleration in cm/s/s
				float gravityCompensatedAccel = 980.0 * float(aaWorld.z*(1.0f / MPU6050_2G_SENSITIVITY));
				//compensate for high banked turns if g force > +- 0.5g ignore
				if (abs(gravityCompensatedAccel) > (980 / 2.0)) {
					gravityCompensatedAccel = 0.0;

				}
				if (debug_level > 1) {
					Serial.print("gravity compensated acceleration: ");
					Serial.println(gravityCompensatedAccel);
				}
#else
				// accelerometer samples (ax,ay,az) in Gs, gyroscope samples (gx,gy,gz) in deg/second
				//imu.GetAccelGyroData(accel, gyro);
				mpu.getMotion6(&ax, &ay, &az, &gx, &gy, &gz);
				accel[0] = float(ax - ax_offset)*(1.0f / MPU6050_2G_SENSITIVITY);
				accel[1] = float(ay - ay_offset)*(1.0f / MPU6050_2G_SENSITIVITY);
				accel[2] = float(az - az_offset)*(1.0f / MPU6050_2G_SENSITIVITY);
				gyro[0] = float(gx - gx_offset)*(1.0f / MPU6050_500DPS_SENSITIVITY);
				gyro[1] = float(gy - gy_offset)*(1.0f / MPU6050_500DPS_SENSITIVITY);
				gyro[2] = float(gz - gz_offset)*(1.0f / MPU6050_500DPS_SENSITIVITY);

				//only use acceleration in calculation if g force between 0.75G and 1.25G
				float accelMagnitudeSquared = accel[0] * accel[0] + accel[1] * accel[1] + accel[2] * accel[2];

				int bUseAccel = ((accelMagnitudeSquared > 0.56250f) && (accelMagnitudeSquared < 1.5625f)) ? 1 : 0;

