PhilColbert/AirWhere-esp32/main/vario/airwhere_esp32_vario.cpp
				imu_MahonyAHRSupdate6DOF(bUseAccel, imuTimeDeltaSecs, -DEG_TO_RAD(gyro[0]), DEG_TO_RAD(gyro[1]), DEG_TO_RAD(gyro[2]), -accel[0], accel[1], accel[2]);

				float gravityCompensatedAccel = imu_GravityCompensatedAccel(-accel[0], accel[1], accel[2], q0, q1, q2, q3);
				if (abs(gravityCompensatedAccel) > (980 / 2.0)) {
					//Serial.print("gravity compensated acceleration before setting to 0: "); Serial.println(gravityCompensatedAccel);
					gravityCompensatedAccel = 0.0;

				}
				if (debug_level > 1) {
					Serial.print("gravity compensated acceleration: ");
					Serial.print(gravityCompensatedAccel);
					Serial.print(",");
					Serial.println(gravityCompensatedAccel / 980.0);
				}
				//Serial.print("Quaternio vector w x y z"); Serial.print(q0); Serial.print(" "); Serial.print(q1); Serial.print(" "); Serial.print(q2); Serial.print(" "); Serial.println(q3);
				//Serial.print("ax "); Serial.print(ax); Serial.print(" ay "); Serial.print(ay); Serial.print(" az "); Serial.println(az);
				//Serial.print("gx "); Serial.print(gx); Serial.print(" gy "); Serial.print(gy); Serial.print(" gz "); Serial.println(gz);
				//Serial.print("q0 "); Serial.print(q0, 4); Serial.print(" q1 "); Serial.print(q1, 4); Serial.print(" q2 "); Serial.print(q2, 4); Serial.print(" q3 "); Serial.println(q3, 4);

#ifdef OUTPUT_TEAPOT
				// display quaternion values in InvenSense Teapot demo format:
				teapotPacket[2] = int(q0*16384.0)>>8;
				teapotPacket[3] = int(q0*16384.0) && 0xFF;
				teapotPacket[4] = int(q1*16384.0) >> 8;
				teapotPacket[5] = int(q1*16384.0) && 0xFF;
				teapotPacket[6] = int(q2*16384.0) >> 8;
				teapotPacket[7] = int(q2*16384.0) && 0xFF;
				teapotPacket[8] = int(q3*16384.0) >> 8;
				teapotPacket[9] = int(q3*16384.0) && 0xFF;
				Serial.write(teapotPacket, 14);
				teapotPacket[11]++; // packetCount, loops at 0xFF on purpose
#endif
#endif


				zAccelAccumulator += gravityCompensatedAccel; // one earth-z acceleration value computed every 10mS, accumulate

				baroCounter++;
				baroTimeDeltaSecs += imuTimeDeltaSecs;
				//Serial.print("mpu time delta secs"); Serial.println(imuTimeDeltaSecs,3); //this should be 10ms
				if (baroCounter >= 1) { // ~10mS elapsed, this is the sampling period for MS5611,
					baroCounter = 0;    // alternating between pressure and temperature samples

					int zMeasurementAvailable = baro.SampleStateMachine(); // one z (altitude) sample calculated for every new pair of pressure & temperature samples
					if (zMeasurementAvailable) {
						//Serial.print("baro time delta secs"); Serial.println(baroTimeDeltaSecs);
						float zAccelAverage = zAccelAccumulator / 2.0f; // average earth-z acceleration over the 20mS interval between z samples
						//Serial.print("baro in pascal "); Serial.println(baro.paSample_); Serial.print("last pressure reading "); Serial.println(last_sample_pressure);

						if (int(baro.paSample_) > PRESSURE_AT_18000_FT && int(baro.paSample_) < PRESSURE_AT_0_FT && (last_sample_pressure == 0 ||(ABS(last_sample_pressure - int(baro.paSample_)) < 10))) //only accept valid pressure readings
						{
							if (debug_level > 1) {
								Serial.printf("Updating Kalman filter with height %f and average accel %f \r\n", baro.zCmSample_, zAccelAverage);
								Serial.printf("baro sample pressure: %d last_sample_pressure %d\r\n", int(baro.paSample_), last_sample_pressure);
							}
							kf.Update(baro.zCmSample_, zAccelAverage, baroTimeDeltaSecs, &kfAltitudeCm, &kfClimbrateCps);
							//calculate the integrated cps over period of net_vario secs default 1s - represents 200 samples at 20ms sample rate
							avgeCps = runningAverageofCps(kfClimbrateCps);
							//Serial.printf("1s average cps %d\r\n", int(avgeCps));

							current_pressure = (int)baro.paSample_;
							current_altitude = (int)(kfAltitudeCm / 100.0);
							current_vario = (int)kfClimbrateCps;
							current_temperature = (int)baro.celsiusSample_;
							current_battery = batteryVoltage();
						}
					//	else
					//	{
					//		Serial.println("");
					//		Serial.printf("Ignoring sample with baro pressure of %d and last sample pressure of %d \r\n", int(baro.paSample_), last_sample_pressure);
					//		Serial.println("");

					//	}

						last_sample_pressure = (int)baro.paSample_;
						zAccelAccumulator = 0.0f;
						baroTimeDeltaSecs = 0.0f;
						audioCps = avgeCps >= 0.0f ? (int32_t)(avgeCps + 0.5f) : (int32_t)(avgeCps - 0.5f);
						if (ABS(audioCps) > SLEEP_THRESHOLD_CPS) { // reset sleep timeout watchdog if there is significant vertical motion
							timeoutSeconds = 0;
						}
						/*if (timeoutSeconds >= SLEEP_TIMEOUT_SECONDS) {
							Serial.print("Timed out, put MPU6050 and ES32 to sleep to minimize current draw when using battery\r\n");
							Serial.flush();
							indicatePowerDown();
							powerDown();
						}*/
						CLAMP(audioCps, -1000, 1000); // clamp climbrate to +/- 10m/sec
						//Serial.println("tofb " + String( turn_on_off_buzzer) + "*");
						audio.VarioBeep(audioCps, turnonBuzzer);

					}
				}
			}



			//if ((drdyCounter % 50) == 1) Serial.printf("bAlt = %d kfAlt = %d kfVario = %d\r\n", (int)baro.zCmSample_, (int)kfAltitudeCm, (int)avgeCps);
			if (drdyCounter >= 100) {
				drdyCounter = 0;
				timeoutSeconds++; // 100 * 10mS = 1 second
				turnonBuzzer++;
				turnonBuzzer = (turnonBuzzer % 10);
#ifdef IMU_DEBUG

                           uint32_t elapsedUs = micros() - timePreviousUs; // calculate time  taken in reading and processing the data, should be less than 5mS worst case

                           Serial.printf("Elapsed %dus\r\n", (int)elapsedUs);

                           Serial.printf("bAlt = %d kfAlt = %d kfVario = %d\r\n", (int)baro.zCmSample_, (int)kfAltitudeCm, (int)kfClimbrateCps);



#endif
			}

		}
	}
}



